[
    {
        "id": 1,
        "tipo": "Animes",  "categoria": "Action",
        "episodios": [
            {
                "nome": "To You, in 2000 Years: The Fall of Shiganshina, Part 1",
                "duracao": "24 min",
                "descricao": "A humanidade recebe um lembrete brutal de que eles estão ameaçados pelos titãs."
            },
            {
                "nome": "That Day: The Fall of Shiganshina, Part 2",
                "duracao": "24 min",
                "descricao": "Eren jura que ele vai matar todos os titãs e vingar toda a humanidade."
            },
            {
                "nome": "A Dim Light Amid Despair: Humanity's Comeback, Part 1",
                "duracao": "24 min",
                "descricao": "Enquanto a humanidade organiza uma nova resistência, Eren encontra motivação para lutar."
            },
            {
                "nome": "The Night of the Closing Ceremony: Humanity's Comeback, Part 2",
                "duracao": "24 min",
                "descricao": "Os novos recrutas tomam suas posições enquanto os titãs começam uma nova ofensiva."
            },
            {
                "nome": "First Battle: The Struggle for Trost, Part 1",
                "duracao": "24 min",
                "descricao": "Eren enfrenta a realidade da luta contra os titãs depois de juntar-se ao esforço de guerra."
            },
            {
                "nome": "The World the Girl Saw: The Struggle for Trost, Part 2",
                "duracao": "24 min",
                "descricao": "A visão da batalha através dos olhos de Mikasa revela um passado compartilhado."
            },
            {
                "nome": "Small Blade: The Struggle for Trost, Part 3",
                "duracao": "24 min",
                "descricao": "A luta para defender Trost se intensifica enquanto os recrutas enfrentam perdas devastadoras."
            },
            {
                "nome": "I Can Hear His Heartbeat: The Struggle for Trost, Part 4",
                "duracao": "24 min",
                "descricao": "A equipe de Eren descobre uma nova tática que pode dar-lhes uma vantagem crucial."
            },
            {
                "nome": "Whereabouts of His Left Arm: The Struggle for Trost, Part 5",
                "duracao": "24 min",
                "descricao": "O mistério sobre o poder de Eren começa a se revelar enquanto a batalha continua."
            },
            {
                "nome": "Response: The Struggle for Trost, Part 6",
                "duracao": "24 min",
                "descricao": "As respostas sobre os titãs podem oferecer novas estratégias para a humanidade."
            },
            {
                "nome": "Idol: The Struggle for Trost, Part 7",
                "duracao": "24 min",
                "descricao": "As crenças de Eren são testadas quando ele tenta controlar seu poder transformador."
            },
            {
                "nome": "Wound: The Struggle for Trost, Part 8",
                "duracao": "24 min",
                "descricao": "A recuperação de Eren traz novas complexidades para a luta contra os titãs."
            }
        ],
        "titulo": "Attack on Titan",
        "descricaoGeral": "A humanidade luta pela sobrevivência contra gigantes devoradores de homens.",
        "rate": "5",
        "imagem": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p10701949_b_v8_ah.jpg",
        "quality": "Full HD",
        "date": "2013"
    },
    
    {
        "id": 2,
        "tipo": "Animes",
        "episodios": [
            {
                "nome": "Enter Naruto Uzumaki!",
                "duracao": "24 min",
               
                "descricao": "Naruto makes mischief around the village to get attention while preparing for his graduation from the Ninja Academy."
            },
            {
                "nome": "I am Konohamaru!",
               
                "duracao": "24 min",
                "descricao": "Naruto befriends Konohamaru, and the two bond over their struggles to live up to expectations."
            },
            {
                "nome": "Sasuke and Sakura: Friends or Foes?",
            
                "duracao": "24 min",
                "descricao": "Naruto, Sasuke, and Sakura are teamed up and begin to learn the dynamics of teamwork."
            },
            {
                "nome": "Pass or Fail: Survival Test",
               
                "duracao": "24 min",
                "descricao": "New instructor Kakashi challenges Team 7 with a nearly impossible task to test their limits and skills."
            },
            {
                "nome": "You Failed! Kakashi's Final Decision",
              
                "duracao": "24 min",
                "descricao": "The team faces the possibility of failure as Kakashi makes a critical decision about their future."
            },
            {
                "nome": "A Dangerous Mission! Journey to the Land of Waves!",
              
                "duracao": "24 min",
                "descricao": "Team 7 receives their first major mission, taking them beyond the safe confines of the village."
            },
            {
                "nome": "The Assassin of the Mist!",
               
                "duracao": "24 min",
                "descricao": "While on a mission, Team 7 encounters Zabuza, the ruthless assassin from the Mist."
            },
            {
                "nome": "The Oath of Pain",
                
                "duracao": "24 min",
                "descricao": "The battle with Zabuza intensifies, pushing the team to a new understanding of what it means to be a ninja."
            },
            {
                "nome": "Kakashi: Sharingan Warrior",
              
                "duracao": "24 min",
                "descricao": "The secrets of Kakashi's Sharingan are revealed as he battles to protect his students."
            },
            {
                "nome": "The Forest of Chakra",
               
                "duracao": "24 min",
                "descricao": "Naruto and his team learn to better control their chakra under Kakashi's guidance."
            },
            {
                "nome": "The Land Where a Hero Once Lived",
              
                "duracao": "24 min",
                "descricao": "Sakura reflects on what it means to be a ninja and the legacy of the village's heroes."
            },
            {
                "nome": "Battle on the Bridge! Zabuza Returns!!",
             
                "duracao": "24 min",
                "descricao": "The confrontation with Zabuza reaches a climax, challenging Naruto and his friends like never before."
            }
        ],
        "titulo": "Naruto", "categoria": "Adventure","fundoImg":"https://m.media-amazon.com/images/S/pv-target-images/37ae6eaf1e35049384801438c20a4dec3aa06593542c9770c83935d6b84a3e59._SX1080_FMjpg_.jpg",
        "descricaoGeral": "A young ninja dreams of becoming the greatest Hokage in his village.",
        "rate": "4",
        "imagem": "https://m.media-amazon.com/images/M/MV5BZTNjOWI0ZTAtOGY1OS00ZGU0LWEyOWYtMjhkYjdlYmVjMDk2XkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
        "quality": "HD",
        "date": "2002"
    },

    {
        "id": 3,
        "tipo": "Animes",
        "categoria": "Action",
        "episodios": [
            {
                "nome": "Izuku Midoriya: Origin",
                "duracao": "24 min",
                "descricao": "Izuku Midoriya desperately wants to be a hero, but he is one of the few in his generation born without a Quirk."
            },
            {
                "nome": "What It Takes to Be a Hero",
                "duracao": "24 min",
                "descricao": "Izuku accidentally learns of All Might's secret, but there's trouble in town again before Izuku has time to process it."
            },
            {
                "nome": "Roaring Muscles",
                "duracao": "24 min",
                "descricao": "All Might tells Izuku that he can become a hero, but does he really have what it takes to become one?"
            },
            {
                "nome": "Start Line",
                "duracao": "24 min",
                "descricao": "Izuku's first day at U.A. High School throws him directly into the Hero Course action."
            },
            {
                "nome": "What I Can Do for Now",
                "duracao": "24 min",
                "descricao": "With his new power, Izuku manages to catch up to the rest of his classmates."
            },
            {
                "nome": "Rage, You Damn Nerd",
                "duracao": "24 min",
                "descricao": "The training to become the strongest hero is tough and not all can keep up with it."
            },
            {
                "nome": "Deku vs. Kacchan",
                "duracao": "24 min",
                "descricao": "A fight breaks out between the two childhood friends: Izuku and Bakugo."
            },
            {
                "nome": "Bakugo's Start Line",
                "duracao": "24 min",
                "descricao": "Bakugo's anger gets the best of him during the training session."
            },
            {
                "nome": "Yeah, Just Do Your Best, Iida!",
                "duracao": "24 min",
                "descricao": "Class 1-A works on developing their Quirks and creating ultimate moves to get ready for the provisional hero licensing exam."
            },
            {
                "nome": "Encounter with the Unknown",
                "duracao": "24 min",
                "descricao": "Villains attack U.A. High School during the training session, putting everyone in danger."
            },
            {
                "nome": "Game Over",
                "duracao": "24 min",
                "descricao": "The heroes fight desperately against villains to protect their school and their friends."
            },
            {
                "nome": "All Might",
                "duracao": "24 min",
                "descricao": "All Might fights with everything he's got to protect his students from harm."
            }
        ],
        "titulo": "My Hero Academia",
        "descricao": "Em um mundo de superpoderes, um jovem sem poderes sonha em ser herói.",
        "rate": "5",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/6e008ad5211c3998b8f3e4bc166821cd.jpg",
        "quality": "4K",
        "date": "2016"
    },
    {
        "id": 4,
        "tipo": "Animes",
        "categoria": "Adventure",
        "episodios": [
            {
                "nome": "I'm Luffy! The Man Who's Gonna Be King of the Pirates!",
                "duracao": "24 min",
                "descricao": "Luffy sets out on his adventure to find the legendary treasure, One Piece."
            },
            {
                "nome": "Enter the Great Swordsman! Pirate Hunter Roronoa Zoro!",
                "duracao": "24 min",
                "descricao": "Luffy encounters and befriends Zoro, the feared swordsman."
            },
            {
                "nome": "Morgan vs. Luffy! Who's the Mysterious Pretty Girl?",
                "duracao": "24 min",
                "descricao": "Luffy and his new friend Zoro fight against the corrupt Marine Captain Morgan."
            },
            {
                "nome": "Luffy's Past! Enter Red-Haired Shanks!",
                "duracao": "24 min",
                "descricao": "Luffy's motivations and past connections with the pirate Shanks are revealed."
            },
            {
                "nome": "Fear, Mysterious Power! Pirate Clown Captain Buggy!",
                "duracao": "24 min",
                "descricao": "The crew encounters Captain Buggy, a pirate with the ability to separate his body parts."
            },
            {
                "nome": "Desperate Situation! Beast Tamer Mohji vs. Luffy!",
                "duracao": "24 min",
                "descricao": "Luffy faces off against Mohji and his powerful lion."
            },
            {
                "nome": "Epic Showdown! Swordsman Zoro vs. Acrobat Cabaji!",
                "duracao": "24 min",
                "descricao": "Zoro battles Cabaji in a fierce fight."
            },
            {
                "nome": "Who is the Victor? Devil Fruit Power Showdown!",
                "duracao": "24 min",
                "descricao": "Luffy and Buggy demonstrate the powers of their Devil Fruits in a climactic battle."
            },
            {
                "nome": "The Honorable Liar? Captain Usopp!",
                "duracao": "24 min",
                "descricao": "The crew meets Usopp, a local villager with a penchant for lying."
            },
            {
                "nome": "The Weirdest Guy Ever! Jango the Hypnotist!",
                "duracao": "24 min",
                "descricao": "The crew faces Jango, a hypnotist who uses his powers for crime."
            },
            {
                "nome": "Expose the Plot! Pirate Butler, Captain Kuro!",
                "duracao": "24 min",
                "descricao": "The crew uncovers a sinister plot by Captain Kuro, a pirate posing as a butler."
            },
            {
                "nome": "Clash with the Black Cat Pirates! The Great Battle on the Slope!",
                "duracao": "24 min",
                "descricao": "A massive battle ensues between the Straw Hat Pirates and the Black Cat Pirates."
            }
        ],
        "titulo": "One Piece",
        "descricao": "Luffy e seus amigos navegam pelos mares em busca do tesouro lendário, o One Piece.",
        "rate": "5",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/2239c7b46b2e491ae33b33ff980e9fb1.jpe",
        "quality": "Full HD",
        "date": "1999"
    },
    
    {
        "id": 5,
        "tipo": "Animes",
        "categoria": "Supernatural",
        "episodios": [
            {
                "nome": "Cruelty",
                "duracao": "24 min",
                "descricao": "Tanjiro's peaceful life is shattered when a demon slaughters his family and leaves his sister Nezuko transformed."
            },
            {
                "nome": "Trainer Sakonji Urokodaki",
                "duracao": "24 min",
                "descricao": "Tanjiro meets his new master and begins his training to join the Demon Slayer Corps."
            },
            {
                "nome": "Sabito and Makomo",
                "duracao": "24 min",
                "descricao": "Through rigorous trials, Tanjiro learns the Water Breathing technique, guided by the mysterious children Sabito and Makomo."
            },
            {
                "nome": "Final Selection",
                "duracao": "24 min",
                "descricao": "Tanjiro faces the final selection test that will determine his future as a Demon Slayer."
            },
            {
                "nome": "My Own Steel",
                "duracao": "24 min",
                "descricao": "Tanjiro completes his training and earns his own demon slayer sword."
            },
            {
                "nome": "Swordsman Accompanying a Demon",
                "duracao": "24 min",
                "descricao": "Tanjiro begins his first mission and encounters a demon with a grudge against the Demon Slayer Corps."
            },
            {
                "nome": "Muzan Kibutsuji",
                "duracao": "24 min",
                "descricao": "Tanjiro encounters Muzan Kibutsuji, the demon responsible for his family's tragedy."
            },
            {
                "nome": "The Smell of Enchanting Blood",
                "duracao": "24 min",
                "descricao": "The scent of blood leads Tanjiro to another deadly encounter with a demon."
            },
            {
                "nome": "Temari Demon and Arrow Demon",
                "duracao": "24 min",
                "descricao": "Tanjiro battles two powerful demons who challenge his Water Breathing techniques."
            },
            {
                "nome": "Together Forever",
                "duracao": "24 min",
                "descricao": "With the help of his sister Nezuko, Tanjiro fights to protect the innocent."
            },
            {
                "nome": "Tsuzumi Mansion",
                "duracao": "24 min",
                "descricao": "Tanjiro and his companions find themselves trapped in a mysterious mansion."
            },
            {
                "nome": "The Boar Bares Its Fangs, Zenitsu Sleeps",
                "duracao": "24 min",
                "descricao": "A new ally and a new challenge arise as Tanjiro tries to escape the dangerous maze of the mansion."
            }
        ],
        "titulo": "Demon Slayer",
        "descricao": "Tanjiro luta para salvar sua irmã e vingar sua família destruída por demônios.",
        "rate": "5",
        "imagem": "https://a.storyblok.com/f/178900/2129x3010/914c669afa/demon-slayer-swordsmith-village-arc-2x3.jpg/m/filters:quality(95)format(webp)",
        "quality": "HD",
        "date": "2019"
    },
    
    {
        "id": 6,
        "tipo": "Animes",
        "categoria": "Thriller",
        "episodios": [
            {
                "nome": "Rebirth",
                "duracao": "23 min",
                "descricao": "Light Yagami discovers the Death Note and tests its powers on criminals."
            },
            {
                "nome": "Confrontation",
                "duracao": "23 min",
                "descricao": "L, the world-renowned detective, suspects that Kira is located in Japan and a psychological duel begins."
            },
            {
                "nome": "Dealings",
                "duracao": "23 min",
                "descricao": "Light decides to create a perfect world and plans to use the Death Note to eradicate criminals."
            },
            {
                "nome": "Pursuit",
                "duracao": "23 min",
                "descricao": "L closes in on Kira by deploying surveillance cameras and wiretaps in the Kanto region."
            },
            {
                "nome": "Tactics",
                "duracao": "23 min",
                "descricao": "Light must find a way to protect his identity while under the watchful eyes of surveillance."
            },
            {
                "nome": "Unraveling",
                "duracao": "23 min",
                "descricao": "Light meets a woman with an urgent message about the Death Note."
            },
            {
                "nome": "Overcast",
                "duracao": "23 min",
                "descricao": "Light manipulates events to gain more information about the people investigating him."
            },
            {
                "nome": "Glare",
                "duracao": "23 min",
                "descricao": "Light and L finally meet, and suspicions lead to strategies to catch one another."
            },
            {
                "nome": "Encounter",
                "duracao": "23 min",
                "descricao": "Light struggles to mask his manipulation of the Death Note while he and L grow closer."
            },
            {
                "nome": "Doubt",
                "duracao": "23 min",
                "descricao": "The investigation team discusses the ethics of using the Death Note to kill criminals."
            },
            {
                "nome": "Assault",
                "duracao": "23 min",
                "descricao": "A new Kira appears, complicating Light's plans and adding a new layer of danger."
            },
            {
                "nome": "Love",
                "duracao": "23 min",
                "descricao": "Misa Amane, a popular idol and Kira supporter, encounters Light and reveals her own Death Note."
            }
        ],
        "titulo": "Death Note",
        "descricao": "Um estudante encontra um caderno que lhe permite matar qualquer pessoa ao escrever seu nome.",
        "rate": "5",
        "imagem": "https://publish.one37pm.net/wp-content/uploads/2023/03/MV5BNjRiNmNjMmMtN2U2Yi00ODgxLTk3OTMtMmI1MTI1NjYyZTEzXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_FMjpg_UX1000_.jpg?fit=1000%2C1500",
        "quality": "HD",
        "date": "2006"
    },

    
    {
        "id": 7,
        "tipo": "Animes",
        "categoria": "Horror",
        "episodios": [
            {
                "nome": "Tragedy",
                "duracao": "24 min",
                "descricao": "Kaneki's date with Rize takes a dark turn, changing his life forever."
            },
            {
                "nome": "Incubation",
                "duracao": "24 min",
                "descricao": "Kaneki struggles to adapt to his new nature as a half-ghoul."
            },
            {
                "nome": "Dove",
                "duracao": "24 min",
                "descricao": "Kaneki and Touka face the threat of investigators from the CCG."
            },
            {
                "nome": "Supper",
                "duracao": "24 min",
                "descricao": "Tensions rise within Anteiku as ghouls and humans clash."
            },
            {
                "nome": "Scars",
                "duracao": "24 min",
                "descricao": "Kaneki wrestles with the monster he's becoming."
            },
            {
                "nome": "Cloudburst",
                "duracao": "24 min",
                "descricao": "A violent rainstorm brings fresh conflicts to the 20th Ward."
            },
            {
                "nome": "Captivity",
                "duracao": "24 min",
                "descricao": "Kaneki finds himself held captive by a sadistic ghoul."
            },
            {
                "nome": "Circular",
                "duracao": "24 min",
                "descricao": "Kaneki's search for allies leads him to an underground group."
            },
            {
                "nome": "Birdcage",
                "duracao": "24 min",
                "descricao": "Kaneki tries to protect his friends as the CCG tightens their grip."
            },
            {
                "nome": "Aogiri",
                "duracao": "24 min",
                "descricao": "Kaneki is forced to make a choice that will define his path."
            },
            {
                "nome": "High Spirits",
                "duracao": "24 min",
                "descricao": "Kaneki embraces his new identity."
            },
            {
                "nome": "Ghoul",
                "duracao": "24 min",
                "descricao": "Kaneki confronts the reality of the world he lives in."
            }
        ],
        "titulo": "Tokyo Ghoul",
        "descricao": "Um estudante se transforma em meio-ghoul e luta para sobreviver em um mundo de monstros.",
        "rate": "4",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/6c496691df13a15aaf9be63caa7fc429.jpg",
        "quality": "HD",
        "date": "2014"
    },
    
    {
        "id": 8,
        "tipo": "Animes",
        "categoria": "Adventure",
        "episodios": [
            {
                "nome": "Departure x And x Friends",
                "duracao": "24 min",
                "descricao": "Gon starts his journey to become a Hunter and meet his father."
            },
            {
                "nome": "Test x Of x Tests",
                "duracao": "24 min",
                "descricao": "Gon and his new friends face their first challenges in the Hunter Exam."
            },
            {
                "nome": "Rivals x In x Survival",
                "duracao": "24 min",
                "descricao": "The Hunter Exam heats up as Gon's group faces formidable rivals."
            },
            {
                "nome": "Hope x And x Ambition",
                "duracao": "24 min",
                "descricao": "The candidates are pushed to their limits in a grueling test."
            },
            {
                "nome": "Hisoka x Is x Sneaky",
                "duracao": "24 min",
                "descricao": "Gon encounters Hisoka, a dangerous and unpredictable contestant."
            },
            {
                "nome": "A x Surprising x Challenge",
                "duracao": "24 min",
                "descricao": "The participants face a surprise challenge that tests their resolve."
            },
            {
                "nome": "Showdown x On x The Airship",
                "duracao": "24 min",
                "descricao": "Tensions rise as the first phase of the exam comes to a close."
            },
            {
                "nome": "Decision x By x Majority?",
                "duracao": "24 min",
                "descricao": "The candidates must make difficult decisions to advance in the exam."
            },
            {
                "nome": "Beware x Of x Prisoners",
                "duracao": "24 min",
                "descricao": "Gon's team faces convicts in the next phase of the exam."
            },
            {
                "nome": "Trick x To x The Trick",
                "duracao": "24 min",
                "descricao": "Clever thinking is required to pass the latest test."
            },
            {
                "nome": "Trouble x With x The Gamble",
                "duracao": "24 min",
                "descricao": "A gambling match poses new challenges for the team."
            },
            {
                "nome": "Last x Test x Of x Resolve!",
                "duracao": "24 min",
                "descricao": "The final test of the Hunter Exam begins, with unexpected twists."
            }
        ],
        "titulo": "Hunter x Hunter",
        "descricao": "Gon embarca em uma jornada para se tornar um caçador e encontrar seu pai.",
        "rate": "5",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/cbb55a6382682bf71e91f685c6473c5a.jpg",
        "quality": "4K",
        "date": "2011"
    },
    
    {
        "id": 9,
        "tipo": "Animes",
        "categoria": "Fantasy",
        "episodios": [
            {
                "nome": "The World of Swords",
                "duracao": "23 min",
                "descricao": "Kirito logs into the game world where he and ten thousand others must face the reality of their situation."
            },
            {
                "nome": "Beater",
                "duracao": "23 min",
                "descricao": "Kirito gains a reputation as a solo player and encounters Asuna."
            },
            {
                "nome": "Red-Nosed Reindeer",
                "duracao": "23 min",
                "descricao": "Kirito deals with the emotional aftermath of Sachi's death."
            },
            {
                "nome": "The Black Swordsman",
                "duracao": "23 min",
                "descricao": "Kirito encounters a mysterious NPC and gains a new ally."
            },
            {
                "nome": "Murder in the Safe Zone",
                "duracao": "23 min",
                "descricao": "A murder mystery within the game threatens player safety."
            },
            {
                "nome": "Illusionary Avenger",
                "duracao": "23 min",
                "descricao": "Kirito and Asuna investigate a series of murders linked to a player guild."
            },
            {
                "nome": "The Temperature of the Heart",
                "duracao": "23 min",
                "descricao": "Asuna and Kirito share a personal moment that deepens their bond."
            },
            {
                "nome": "The Sword Dance of Black and White",
                "duracao": "23 min",
                "descricao": "Kirito and Asuna face a new enemy that tests their limits."
            },
            {
                "nome": "The Blue-Eyed Demon",
                "duracao": "23 min",
                "descricao": "The front lines of the game become even more dangerous."
            },
            {
                "nome": "Crimson Killing Intent",
                "duracao": "23 min",
                "descricao": "Asuna's leadership skills are put to the test as they face a powerful boss."
            },
            {
                "nome": "The Girl of Morning Dew",
                "duracao": "23 min",
                "descricao": "Kirito and Asuna take a break from the front lines to enjoy some downtime."
            },
            {
                "nome": "Yui's Heart",
                "duracao": "23 min",
                "descricao": "Kirito and Asuna encounter Yui, a mysterious child with no memories."
            }
        ],
        "titulo": "Sword Art Online",
        "descricao": "Jogadores ficam presos em um MMORPG mortal e precisam lutar para sobreviver.",
        "rate": "4",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/13d6e1ce564b2080bcc39f8ef1288690.jpg",
        "quality": "HD",
        "date": "2012"
    },
    
    {
        "id": 10,
        "tipo": "Animes",
        "categoria": "Cience",
        "episodios": [
            {
                "nome": "Fullmetal Alchemist",
                "duracao": "24 min",
                "descricao": "The Elric brothers begin their quest for the Philosopher's Stone to regain what they've lost."
            },
            {
                "nome": "The First Day",
                "duracao": "24 min",
                "descricao": "Edward and Alphonse's journey leads them to confront their past."
            },
            {
                "nome": "City of Heresy",
                "duracao": "24 min",
                "descricao": "The brothers uncover a religious fraud in Liore while searching for the Stone."
            },
            {
                "nome": "An Alchemist's Anguish",
                "duracao": "24 min",
                "descricao": "The brothers encounter a fellow alchemist who has made a horrific discovery."
            },
            {
                "nome": "Rain of Sorrows",
                "duracao": "24 min",
                "descricao": "A revelation about their mother's death pushes Ed and Al to their emotional limits."
            },
            {
                "nome": "Road of Hope",
                "duracao": "24 min",
                "descricao": "The Elrics meet an important figure from their father's past."
            },
            {
                "nome": "Hidden Truths",
                "duracao": "24 min",
                "descricao": "Edward and Alphonse discover a deep state conspiracy that threatens their mission."
            },
            {
                "nome": "The Fifth Laboratory",
                "duracao": "24 min",
                "descricao": "A lead takes the Elric brothers to a sinister laboratory where secrets about the Stone are revealed."
            },
            {
                "nome": "Created Feelings",
                "duracao": "24 min",
                "descricao": "The brothers grapple with the moral implications of their quest for the Stone."
            },
            {
                "nome": "Separate Destinations",
                "duracao": "24 min",
                "descricao": "Edward and Alphonse's paths diverge as they each find a different clue."
            },
            {
                "nome": "Miracle at Rush Valley",
                "duracao": "24 min",
                "descricao": "The brothers witness the real-life miracles of alchemy."
            },
            {
                "nome": "One is All, All is One",
                "duracao": "24 min",
                "descricao": "Training under Izumi Curtis, the brothers learn a harsh alchemical lesson."
            }
        ],
        "titulo": "Fullmetal Alchemist: Brotherhood",
        "descricao": "Dois irmãos alquimistas procuram a pedra filosofal para restaurar seus corpos.",
        "rate": "5",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/a3508283e4fe7ad3c7659b052654490e.jpg",
        "quality": "4K",
        "date": "2009"
    },
    
    {
        "id": 11,
        "tipo": "Animes",
        "categoria": "Mecha",
        "episodios": [
            {
                "nome": "Stage 01: The Day a New Demon was Born",
                "duracao": "24 min",
                "descricao": "Lelouch Lamperouge, a Britannian student, unexpectedly gains the power of Geass and uses it to begin his rebellion."
            },
            {
                "nome": "Stage 02: The White Knight Awakens",
                "duracao": "24 min",
                "descricao": "Lelouch directs his newfound powers towards the Britannian forces, plotting a rebellion."
            },
            {
                "nome": "Stage 03: The False Classmate",
                "duracao": "24 min",
                "descricao": "Lelouch maneuvers through political intrigue and tests the limits of his power."
            },
            {
                "nome": "Stage 04: His Name is Zero",
                "duracao": "24 min",
                "descricao": "Zero makes his first public appearance, challenging the legitimacy of Britannia."
            },
            {
                "nome": "Stage 05: The Princess and the Witch",
                "duracao": "24 min",
                "descricao": "Zero starts to gather allies around him as the rebellion grows in strength."
            },
            {
                "nome": "Stage 06: The Stolen Mask",
                "duracao": "24 min",
                "descricao": "The identity of Zero starts causing trouble for Lelouch's everyday life."
            },
            {
                "nome": "Stage 07: Attack Cornelia",
                "duracao": "24 min",
                "descricao": "Zero's group undertakes a risky operation to capture Cornelia."
            },
            {
                "nome": "Stage 08: The Black Knights",
                "duracao": "24 min",
                "descricao": "Lelouch forms his own army called the Black Knights."
            },
            {
                "nome": "Stage 09: Refrain",
                "duracao": "24 min",
                "descricao": "The consequences of the drug Refrain come to light, affecting someone close to Lelouch."
            },
            {
                "nome": "Stage 10: Guren Dances",
                "duracao": "24 min",
                "descricao": "A new powerful mech, the Guren, appears on the battlefield."
            },
            {
                "nome": "Stage 11: Battle for Narita",
                "duracao": "24 min",
                "descricao": "The Black Knights engage in a major battle at Narita."
            },
            {
                "nome": "Stage 12: The Messenger from Kyoto",
                "duracao": "24 min",
                "descricao": "Zero receives an important offer from the Kyoto Group."
            }
        ],
        "titulo": "Code Geass",
        "descricao": "Um jovem ganha um poder especial e decide liderar uma rebelião contra o Império.",
        "rate": "5",
        "imagem": "https://a.storyblok.com/f/178900/640x960/566ed42091/3b1b6e977fd38837c005c68b739564701500588647_full.jpg/m/640x960",
        "quality": "HD",
        "date": "2006"
    },
    
    {
        "id": 12,
        "tipo": "Animes",
        "categoria": "Action",
        "episodios": [
            {
                "nome": "The Strongest Man",
                "duracao": "24 min",
                "descricao": "Saitama appears as a hero that can defeat any opponent with a single punch, but he is bored by his overwhelming strength."
            },
            {
                "nome": "The Lone Cyborg",
                "duracao": "24 min",
                "descricao": "Genos, a cyborg who wants to be Saitama's disciple, appears and they team up."
            },
            {
                "nome": "The Obsessive Scientist",
                "duracao": "24 min",
                "descricao": "Saitama and Genos encounter a scientist who has been turning himself into a monster."
            },
            {
                "nome": "The Modern Ninja",
                "duracao": "24 min",
                "descricao": "Saitama takes on Speed-o'-Sound Sonic, a ninja who is looking for worthy opponents."
            },
            {
                "nome": "The Ultimate Master",
                "duracao": "24 min",
                "descricao": "Saitama and Genos join the Hero Association to gain official recognition."
            },
            {
                "nome": "The Terrifying City",
                "duracao": "24 min",
                "descricao": "Rumors about the dangerousness of City Z circulate and investigations begin."
            },
            {
                "nome": "The Ultimate Disciple",
                "duracao": "24 min",
                "descricao": "Genos receives a significant upgrade to battle against new threats."
            },
            {
                "nome": "The Deep Sea King",
                "duracao": "24 min",
                "descricao": "A formidable enemy from the sea emerges, challenging the Hero Association."
            },
            {
                "nome": "Unyielding Justice",
                "duracao": "24 min",
                "descricao": "Saitama faces off against the Deep Sea King to protect the innocent."
            },
            {
                "nome": "Unparalleled Peril",
                "duracao": "24 min",
                "descricao": "A new and unprecedented threat appears, challenging the entire Hero Association."
            },
            {
                "nome": "The Dominator of the Universe",
                "duracao": "24 min",
                "descricao": "Saitama encounters an alien invader who is destroying cities."
            },
            {
                "nome": "The Strongest Hero",
                "duracao": "24 min",
                "descricao": "Saitama faces his strongest enemy yet and hopes to find a challenge."
            }
        ],
        "titulo": "One Punch Man",
        "descricao": "Um herói que derrota qualquer inimigo com um soco busca um adversário digno.",
        "rate": "5",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/d8eed44e3d48097ab5fd36b6815fc18e.jpg",
        "quality": "Full HD",
        "date": "2015"
    },
    
    {
        "id": 13,
        "tipo": "Animes",
        "categoria": "Supernatural",
        "episodios": [
            {
                "nome": "The Day I Became a Shinigami",
                "duracao": "24 min",
                "descricao": "Ichigo Kurosaki, a teenager with the ability to see ghosts, gains the powers of a Soul Reaper."
            },
            {
                "nome": "A Shinigami's Work",
                "duracao": "24 min",
                "descricao": "Ichigo begins his duties as a Soul Reaper and learns about the responsibilities it carries."
            },
            {
                "nome": "The Older Brother's Wish, the Younger Sister's Wish",
                "duracao": "24 min",
                "descricao": "Ichigo encounters a hollow seeking his sister."
            },
            {
                "nome": "Cursed Parakeet",
                "duracao": "24 min",
                "descricao": "Ichigo rescues a boy whose soul is trapped in a cursed parakeet."
            },
            {
                "nome": "Beat the Invisible Enemy!",
                "duracao": "24 min",
                "descricao": "Ichigo battles an unseen enemy threatening his new friend."
            },
            {
                "nome": "Fight to the Death! Ichigo vs. Ichigo",
                "duracao": "24 min",
                "descricao": "A malignant spirit possesses Ichigo's body, causing chaos."
            },
            {
                "nome": "Greetings from a Stuffed Lion",
                "duracao": "24 min",
                "descricao": "A mod soul takes over a stuffed lion, creating unexpected chaos."
            },
            {
                "nome": "June 17, Memories in the Rain",
                "duracao": "24 min",
                "descricao": "Ichigo faces painful memories on the anniversary of his mother's death."
            },
            {
                "nome": "Unbeatable Enemy",
                "duracao": "24 min",
                "descricao": "A powerful new enemy challenges Ichigo's resolve."
            },
            {
                "nome": "Assault on Trip at Sacred Ground!",
                "duracao": "24 min",
                "descricao": "Ichigo and his friends protect a group of spirits from a gang of soul reapers."
            },
            {
                "nome": "The Legendary Quincy",
                "duracao": "24 min",
                "descricao": "Ichigo meets a Quincy, a clan of spiritual warriors, and learns about their history."
            },
            {
                "nome": "A Gentle Right Arm",
                "duracao": "24 min",
                "descricao": "The powers of Ichigo's friend, Orihime, awaken during a battle."
            }
        ],
        "titulo": "Bleach",
        "descricao": "Um jovem com poderes espirituais luta contra almas perdidas para proteger o mundo humano.",
        "rate": "4",
        "imagem": "https://images.t2online.in/cdn-cgi/image/width=1280,quality=70/https://apis.t2online.in/image/journal/article.jpg?img_id=459972&t=1686565145711",
        "quality": "HD",
        "date": "2004"
    },
    
    {
        "id": 14,
        "tipo": "Animes",
        "categoria": "Fantasy",
        "episodios": [
            {
                "nome": "Fairy Tail",
                "duracao": "24 min",
                "descricao": "Lucy Heartfilia joins the Fairy Tail guild and meets Natsu Dragneel, a fire-breathing wizard."
            },
            {
                "nome": "Fire Dragon, Monkey, and Bull",
                "duracao": "24 min",
                "descricao": "Natsu and Lucy embark on their first mission together to retrieve a stolen book."
            },
            {
                "nome": "Infiltrate the Everlue Mansion",
                "duracao": "24 min",
                "descricao": "Lucy and Natsu tackle an influential client's corrupt request."
            },
            {
                "nome": "Dear Kaby",
                "duracao": "24 min",
                "descricao": "The team uncovers the truth behind a deceptively simple mission."
            },
            {
                "nome": "The Wizard in Armor",
                "duracao": "24 min",
                "descricao": "Erza, a powerful member of Fairy Tail, returns to guide the team on a dangerous journey."
            },
            {
                "nome": "Fairies in the Wind",
                "duracao": "24 min",
                "descricao": "The Fairy Tail members participate in a magical exam on a mysterious island."
            },
            {
                "nome": "Flame and Wind",
                "duracao": "24 min",
                "descricao": "Natsu and the team face a formidable enemy with control over wind."
            },
            {
                "nome": "The Strongest Team",
                "duracao": "24 min",
                "descricao": "Natsu, Lucy, and Erza form a powerful alliance for a challenging battle."
            },
            {
                "nome": "Natsu Eats a Village",
                "duracao": "24 min",
                "descricao": "The group encounters a village with a unique problem that only Natsu can solve."
            },
            {
                "nome": "Natsu vs. Erza",
                "duracao": "24 min",
                "descricao": "A friendly rivalry heats up between Natsu and Erza."
            },
            {
                "nome": "The Cursed Island",
                "duracao": "24 min",
                "descricao": "A relaxing vacation turns dangerous as dark forces surround the guild members."
            },
            {
                "nome": "Moon Drip",
                "duracao": "24 min",
                "descricao": "The team races against time to stop a sinister plot during a lunar ritual."
            }
        ],
        "titulo": "Fairy Tail",
        "descricao": "Magos de uma guilda poderosa enfrentam inimigos e formam laços profundos de amizade.",
        "rate": "4",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/18638d44e180fd1b51870106b88e46e4.jpg",
        "quality": "HD",
        "date": "2009"
    },
    
    {
        "id": 15,
        "tipo": "Animes",
        "categoria": "Adventure",
        "episodios": [
            {
                "nome": "Asteroid Blues",
                "duracao": "24 min",
                "descricao": "Spike and Jet's first adventure. They are hunting an ex-gangster who's on the run."
            },
            {
                "nome": "Stray Dog Strut",
                "duracao": "24 min",
                "descricao": "The duo is after a runaway experimental animal with a valuable microchip."
            },
            {
                "nome": "Honky Tonk Women",
                "duracao": "24 min",
                "descricao": "Faye Valentine joins the crew after a casino heist intertwines their fates."
            },
            {
                "nome": "Gateway Shuffle",
                "duracao": "24 min",
                "descricao": "Facing eco-terrorists, the crew of the Bebop must prevent a biological disaster."
            },
            {
                "nome": "Ballad of Fallen Angels",
                "duracao": "24 min",
                "descricao": "Spike's past comes back to haunt him as he goes after a member of the Red Dragon Syndicate."
            },
            {
                "nome": "Sympathy for the Devil",
                "duracao": "24 min",
                "descricao": "A seemingly immortal child teaches Spike about the hardships of growing old."
            },
            {
                "nome": "Heavy Metal Queen",
                "duracao": "24 min",
                "descricao": "Space truckers and a missing explosive device put the Bebop crew in danger."
            },
            {
                "nome": "Waltz for Venus",
                "duracao": "24 min",
                "descricao": "Spike is on a mission to find a rare medicine on Venus."
            },
            {
                "nome": "Jamming with Edward",
                "duracao": "24 min",
                "descricao": "The crew meets a bizarre hacker prodigy who can track down any signal."
            },
            {
                "nome": "Ganymede Elegy",
                "duracao": "24 min",
                "descricao": "Jet faces his past and a former love while tracking a bounty."
            },
            {
                "nome": "Toys in the Attic",
                "duracao": "24 min",
                "descricao": "A strange organism aboard the Bebop brings danger to the crew."
            },
            {
                "nome": "Jupiter Jazz (Part 1)",
                "duracao": "24 min",
                "descricao": "The crew splits up after a fallout, leading to individual confrontations."
            }
        ],
        "titulo": "Cowboy Bebop",
        "descricao": "Caçadores de recompensas no espaço navegam por perigos em um universo cyberpunk.",
        "rate": "5",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/cecc82b73e8ef376a60f095bd94c36d9.jpg",
        "quality": "HD",
        "date": "1998"
    },
    
    {
        "id": 16,
        "tipo": "Animes",
        "categoria": "Action",
        "episodios": [
            {
                "nome": "Dio the Invader",
                "duracao": "24 min",
                "descricao": "Jonathan Joestar's life turns tumultuous with the arrival of his ambitious new brother, Dio Brando."
            },
            {
                "nome": "A Letter from the Past",
                "duracao": "24 min",
                "descricao": "Jonathan discovers Dio's dark intentions and seeks to stop him."
            },
            {
                "nome": "Youth with Dio",
                "duracao": "24 min",
                "descricao": "As Dio gains power, Jonathan trains under the mysterious Ripple technique."
            },
            {
                "nome": "Overdrive",
                "duracao": "24 min",
                "descricao": "Jonathan puts his new abilities to the test against Dio's vampiric powers."
            },
            {
                "nome": "The Dark Knights",
                "duracao": "24 min",
                "descricao": "Dio returns with an army of the undead to confront Jonathan."
            },
            {
                "nome": "Tomorrow's Courage",
                "duracao": "24 min",
                "descricao": "The Joestar group faces off against Dio's strongest warriors."
            },
            {
                "nome": "Sorrowful Successor",
                "duracao": "24 min",
                "descricao": "A tragic loss pushes Jonathan to his limits."
            },
            {
                "nome": "Bloody Battle! JoJo & Dio",
                "duracao": "24 min",
                "descricao": "A final showdown between Jonathan and Dio decides their fates."
            },
            {
                "nome": "The Final Ripple!",
                "duracao": "24 min",
                "descricao": "Jonathan uses everything he has learned to end the battle with Dio."
            },
            {
                "nome": "New York's JoJo",
                "duracao": "24 min",
                "descricao": "Years later, a new generation of Joestars continues the fight against evil."
            },
            {
                "nome": "The Game Master",
                "duracao": "24 min",
                "descricao": "Joseph Joestar, the new hero, faces off against a psychic foe."
            },
            {
                "nome": "The Pillar Man",
                "duracao": "24 min",
                "descricao": "An ancient being awakens, posing a new threat to the world."
            }
        ],
        "titulo": "JoJo's Bizarre Adventure",
        "descricao": "Cada geração da família Joestar luta contra forças sobrenaturais e o destino.",
        "rate": "4",
        "imagem": "https://a.storyblok.com/f/178900/640x960/b5ee16b3b0/262f2c71faace47a5a10ecdaed030f121420672710_full.jpg/m/640x960",
        "quality": "Full HD",
        "date": "2012"
    },
    
    {
        "id": 17,
        "tipo": "Animes",
        "categoria": "Drama",
        "episodios": [
            {
                "nome": "What is Evil? Whatever Springs from Weakness.",
                "duracao": "24 min",
                "descricao": "Ayanokouji Kiyotaka enters an elite school and hides his abilities to observe his classmates."
            },
            {
                "nome": "It takes a great talent and skill to conceal one's talent and skill.",
                "duracao": "24 min",
                "descricao": "Class D receives a poor grade in their first exam, prompting Ayanokouji to subtly influence his peers."
            },
            {
                "nome": "Man is an animal that makes bargains: no other animal does this - no dog exchanges bones with another.",
                "duracao": "24 min",
                "descricao": "Class D learns about the S-System and starts to form alliances."
            },
            {
                "nome": "We should not be upset that others hide the truth from us, when we hide it so often from ourselves.",
                "duracao": "24 min",
                "descricao": "Ayanokouji begins to uncover the secrets of the school and its students."
            },
            {
                "nome": "Hell is other people.",
                "duracao": "24 min",
                "descricao": "The class faces their first group test, and their darkest sides begin to emerge."
            },
            {
                "nome": "There are two kinds of lies; one concerns an accomplished fact, the other concerns a future duty.",
                "duracao": "24 min",
                "descricao": "Ayanokouji manipulates a situation to help a classmate, revealing his strategic nature."
            },
            {
                "nome": "Nothing is as dangerous as an ignorant friend; a wise enemy is to be preferred.",
                "duracao": "24 min",
                "descricao": "Ayanokouji faces challenges both from within and outside his class."
            },
            {
                "nome": "Abandon all hope, ye who enter here.",
                "duracao": "24 min",
                "descricao": "A school cruise introduces new trials that threaten Class D's unity."
            },
            {
                "nome": "Man is condemned to be free.",
                "duracao": "24 min",
                "descricao": "The students confront the consequences of their choices on the cruise."
            },
            {
                "nome": "Every man has in himself the most dangerous traitor of all.",
                "duracao": "24 min",
                "descricao": "A traitor in Class D threatens to unravel Ayanokouji's plans."
            },
            {
                "nome": "What people commonly call fate is mostly their own stupidity.",
                "duracao": "24 min",
                "descricao": "As the end of the year approaches, Class D faces the possibility of expulsion."
            },
            {
                "nome": "Genius lives only one story above madness.",
                "duracao": "24 min",
                "descricao": "Ayanokouji sets a plan in motion to secure his and his classmates' futures."
            }
        ],
        "titulo": "Classroom of the Elite",
        "descricao": "Em uma escola de elite onde o mérito é tudo, um aluno misterioso e solitário manobra para superar os desafios e adversidades com frieza e cálculo.",
        "rate": "4",
        "imagem": "https://a.storyblok.com/f/178900/1061x1500/264952a26b/classroom-of-the-elite-season-4-teaser-visual.jpg/m/filters:quality(95)format(webp)",
        "quality": "Full HD",
        "date": "2017"
    },
    
    {
        "id": 18,
        "tipo": "Animes",
        "categoria": "Horror",
        "episodios": [
            {
                "nome": "Rough Sketch",
                "duracao": "24 min",
                "descricao": "Kouichi Sakakibara transfers to Yomiyama North Middle School and senses something horrifying in his new class."
            },
            {
                "nome": "Blueprint",
                "duracao": "24 min",
                "descricao": "Kouichi discovers an old class photo and starts to unravel the grim mystery tied to his classmates."
            },
            {
                "nome": "Bone Work",
                "duracao": "24 min",
                "descricao": "The specter of death begins to haunt Class 3-3 as students start dying under mysterious circumstances."
            },
            {
                "nome": "Put Flesh",
                "duracao": "24 min",
                "descricao": "Kouichi probes deeper into the curse of Class 3-3 and meets Mei Misaki, a student everyone else ignores."
            },
            {
                "nome": "Build Limbs",
                "duracao": "24 min",
                "descricao": "Kouichi and Mei form a bond as they work together to stop the curse before it claims more lives."
            },
            {
                "nome": "Face to Face",
                "duracao": "24 min",
                "descricao": "The history of the curse is revealed, and the deaths grow more gruesome."
            },
            {
                "nome": "Sphere Joint",
                "duracao": "24 min",
                "descricao": "As the cultural festival approaches, the curse's grip tightens, leading to a critical situation."
            },
            {
                "nome": "Hair Stand",
                "duracao": "24 min",
                "descricao": "Kouichi and his friends find a tape that might explain how to stop the curse."
            },
            {
                "nome": "Body Paint",
                "duracao": "24 min",
                "descricao": "The students try to perform a ritual to calm the vengeful spirit but face deadly consequences."
            },
            {
                "nome": "Glass Eye",
                "duracao": "24 min",
                "descricao": "The curse's origin is traced back to a tragic event involving a previous class."
            },
            {
                "nome": "Makeup",
                "duracao": "24 min",
                "descricao": "Kouichi learns the dark truth about the curse and its ties to Mei Misaki."
            },
            {
                "nome": "Stand by Oneself",
                "duracao": "24 min",
                "descricao": "The students confront the curse in a final attempt to stop the killings and save themselves."
            }
        ],
        "titulo": "Another",
        "descricao": "Em 1972, um aluno popular morre tragicamente durante o ano letivo. Em 1998, um estudante chamado Kouichi Sakakibara transfere-se para a classe que parece esconder um terrível segredo e se depara com um mistério envolvendo mortes horríveis e sobrenaturais.",
        "rate": "4",
        "imagem": "https://imgsrv.crunchyroll.com/cdn-cgi/image/fit=contain,format=auto,quality=85,width=480,height=720/catalog/crunchyroll/6a63d28dc4193210a69c83f1fca67bf2.jpe",
        "quality": "Full HD",
        "date": "2012"
    }
    
    ]
    